<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"a34be76a55643a3715508d2c5ba7831ac0c06586f3a8a3fccb05f7c30ee93765","plan_job_ref":"Job terraform #22 at https://github.com/hybridaccess/nonprod-test-infra/actions/runs/5305715104","plan_hash":"d8d2e24acce67648d7553e129ae4aa63c36082a73bd5db0fb164ef113a565d99","plan_text_format":"text","version":"1.35.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cassandra-rg"
      + tags     = {
          + "dept" = "IT Dept"
        }
    }

  # azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "172.16.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "cassandra-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cassandra-rg"
      + virtual_network_name                           = "cassandra-vnet"
    }

  # azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "172.16.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cassandra-vnet"
      + resource_group_name = "cassandra-rg"
      + subnet              = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [terraform #8](https://github.com/hybridaccess/nonprod-test-infra/actions/runs/5305727413)